_drafts/easy-assignments-deep-concepts.html
---
published: true
layout: post
title: Using easy assignments to introduce deep concepts
tags:  
---

<style>
div.center {text-align:center;}
</style>

<p>
In this early part of the semester, the students don't know all that
much. We haven't covered that many language constructs let along
algorithms, development techniques and all that other good stuff.
</p>

<p>
In terms of the "Java" part of APCS we've talked about basic types,
Strings, basic classes, loops and conditionals. We're limited in the
tools we have but we can still get the classes thinking in the right
way.
</p>

<p>
Last week, when we introduced loops we spent some time drawing shapes.
</p>

<p>
Starting with things like
</p>

Rectangle:
<pre>
*****
*****
*****
</pre>

<p>
and
</p>

Triangle1
<pre>
*
**
***
****
*****
</pre>

<p>
Simple nested loop stuff.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span> = <span style="color: #8b2252;">""</span>;
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">r</span> = 0; r &lt; <span style="color: #228b22;">height</span>; r++) {
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">c</span>=0; c&lt;=r; c++ ){
    s=s+<span style="color: #8b2252;">"*"</span>;<span style="color: #ff0000; font-weight: bold;">"</span>
<span style="color: #8b2252;">  }</span>
<span style="color: #8b2252;">  s=s+"</span>\n<span style="color: #ff0000; font-weight: bold;">"</span><span style="color: #8b2252;">;</span>
<span style="color: #8b2252;">}</span>
<span style="color: #8b2252;">return s;</span>
</pre>
</div>

<p>
Things get interesting when we looked at the next one:
</p>

Triangle2:
<pre>
    *
   **
  ***
 ****
*****
</pre>

<p>
It seems like a simple little problem with a simple solution:
</p>

<p>
What I love about it is that you can look at it in a couple of
interesting ways.
</p>

<p>
First, you can look at those spaces as a triangle in and of
themselves (replaced with # below):
</p>

<pre>
####*
###**
##***
#****
*****
</pre>

<p>
Well, that's almost the same as the Triangle1 from above. Also, if you
take away that triangle of spaces, you're pretty much left with
Triangle1.
</p>

<p>
The structure of the code can look something like:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>=<span style="color: #8b2252;">""</span>;
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">r</span> = 0; r &lt; <span style="color: #228b22;">height</span>; r++){
  <span style="color: #b22222;">// </span><span style="color: #b22222;">loop over the number of spaces we need for this line</span>

  <span style="color: #b22222;">// </span><span style="color: #b22222;">loop over the number of stars we need for this line</span>

  s=s+<span style="color: #8b2252;">"\n"</span>;
}
<span style="color: #a020f0;">return</span> s;
</pre>
</div>

<p>
We can also look at the problem just as a series of lines. How many
spaces and how many stars:
</p>


<p>
Let's say height = 5
</p>
<div class="org-src-container">

<pre class="src src-org"><span style="color: #0000ff;">| row | spaces | stars |</span>
<span style="color: #0000ff;">|-----+--------+-------|</span>
<span style="color: #0000ff;">|   0 |      4 |     1 |</span>
<span style="color: #0000ff;">|   1 |      3 |     2 |</span>
<span style="color: #0000ff;">|   2 |      2 |     3 |</span>
<span style="color: #0000ff;">|   3 |      1 |     4 |</span>
<span style="color: #0000ff;">|   4 |      0 |     5 |</span>
<span style="color: #0000ff;">|-----+--------+-------|</span>
<span style="color: #0000ff;">|   r |  h-r-1 |   r+1 |</span>
<span style="color: #0000ff;">|-----+--------+-------|</span>
</pre>
</div>

<p>
Once we see the relationships between height (h) and row (r) for each
level, we're led to:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>=<span style="color: #8b2252;">""</span>;
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">r</span> = 0; r &lt; <span style="color: #228b22;">height</span>; r++){
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">c</span> = 0 ; c &lt; <span style="color: #228b22;">height</span> - r - 1; c++)
    s=s+<span style="color: #8b2252;">" "</span>;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">c</span> = 0 ; c&lt;<span style="color: #228b22;">r</span>+1; c++)
    s=s+<span style="color: #8b2252;">"*"</span>;
  s=s+<span style="color: #8b2252;">"\n"</span>;
}
<span style="color: #a020f0;">return</span> s;
</pre>
</div>

<p>
We then looked at:
</p>

Triangle3:
<pre>
   *
  ***
 *****
*******
</pre>

<p>
We worked it the same way but also noted that we could take a cheesy
approach to the number of stars on each line. We could start with
numStars=1 and then at the end of the loop, do numStars =
numStars + 2. 
</p>

<p>
I say it's a cheesy solution, but the point is some times you can come
up with a formula (as in the able above) other times you just see how
to change things between iterations.
</p>

<p>
The final problem was this:
</p>

<pre>
   *
  ***
 *****
  ***
   *
   
</pre>

<p>
This time the class noticed that they could start with just calling
Triangle3 and then taking a copy of the Triangle3 code and tweaking
it.
</p>

<p>
This led to a talk of refactoring and ultimately writing  line
routine:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #228b22;">String</span> <span style="color: #0000ff;">line</span>(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">c</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">num</span>){
  <span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>=<span style="color: #8b2252;">""</span>;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0;i&lt;<span style="color: #228b22;">num</span>;i++)
    s=s+c;
  <span style="color: #a020f0;">return</span> s;
}
</pre>
</div>

<p>
Yes, I know we can just do "*"*num but the idea is to get the kids
thinking about things in the right way. On top of just playing with
nested loops, we dealt with:
</p>

<ul class="org-ul">
<li>Looking at problems in multiple ways.
</li>
<li>Coming up with formulas and also just brute force tweaking.
</li>
<li>Re-using existing code.
</li>
<li>refactoring.
</li>
</ul>

<p>
Not a bad set of classes.
</p>
